In [1]:
persondict = {'person':['Bob','Alice','Steve'],'age':[32,24,64],'weight':[128,86,95]}

In [3]:
import pandas as pd
persondict = {'person':['Bob','Alice','Steve'], 'age':[32, 24, 64], 'weight':[128, 86, 95]}
persontable = pd.DataFrame(persondict, columns=['person','age','weight'])
persontable

  person  age  weight
0    Bob   32     128
1  Alice   24      86
2  Steve   64      95

In [4]:
# index the table by person 
persontable = persontable.set_index('person')
persontable

        age  weight
person
Bob      32     128
Alice    24      86
Steve    64      95

In [5]:
persontable.shape
persontable.dtypes

age       int64
weight    int64
dtype: object

In [6]:
# stack the table 
result = persontable.stack()
result

person
Bob     age        32
        weight    128
Alice   age        24
        weight     86
Steve   age        64
        weight     95
dtype: int64

In [7]:
result.shape
result.index

MultiIndex([(  'Bob',    'age'),
            (  'Bob', 'weight'),
            ('Alice',    'age'),
            ('Alice', 'weight'),
            ('Steve',    'age'),
            ('Steve', 'weight')],
           names=['person', None])

In [9]:
# reset the index 
persontall = result.reset_index()
persontall

  person level_1    0
0    Bob     age   32
1    Bob  weight  128
2  Alice     age   24
3  Alice  weight   86
4  Steve     age   64
5  Steve  weight   95

In [10]:
# rename the columns 
persontall.columns=['person','attribute','value']
persontall

  person attribute  value
0    Bob       age     32
1    Bob    weight    128
2  Alice       age     24
3  Alice    weight     86
4  Steve       age     64
5  Steve    weight     95

In [11]:
# convert back to unstack 
result.unstack()

        age  weight
person
Bob      32     128
Alice    24      86
Steve    64      95

In [12]:
# pivot the table 
persontall.pivot('person','attribute','value')

attribute  age  weight
person
Alice       24      86
Bob         32     128
Steve       64      95